# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils' # Those that come with macOS are outdated
brew 'go'
brew 'imagemagick'
brew 'openssl'
brew 'unrar'
brew 'youtube-dl'
brew 'hugo'
brew 'tree'

brew 'asdf'
brew 'gnupg'
brew 'gnupg2'

cask 'vlc'
cask 'google-chrome'
cask 'amazon-music'
cask 'google-drive-file-stream'
cask 'the-unarchiver'

# mac customisation
cask 'alfred'
cask 'bartender'
cask 'spectacle'
cask 'muzzle'
cask 'rocket'
cask 'scroll-reverser'
cask 'switchresx'
cask 'caffeine'

# communications
cask 'twist'
cask 'slack'

# development
brew 'yarn'
cask 'visual-studio-code'
cask 'fork'
cask 'ngrok'
cask 'iterm2'
cask 'postman'
cask 'firefox'
cask 'runjs'
cask 'adoptopenjdk8'

# utilities
cask 'clipgrab'
cask 'kap'
cask '1password'
cask 'handbrake'
cask 'transmission'